Revit 2027 API
FunctionId.Line Property
The line number of the function throwing an exception.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Line { get; }
Public ReadOnly Property Line As Integer
	Get
public:
property int Line {
	int get ();
}
member Line : int with get
Property Value
Int32
See Also
Reference
FunctionId Class
Autodesk.Revit.Exceptions Namespace